Revit 2027 API
BuiltInFailures.LoadFailures.PointLoadNotOverlappingHost Property
 Point load is not overlapping with its entire distribution its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PointLoadNotOverlappingHost { get; }
Public Shared ReadOnly Property PointLoadNotOverlappingHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PointLoadNotOverlappingHost {
	FailureDefinitionId^ get ();
}
static member PointLoadNotOverlappingHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace